<?php

namespace App\Http\Modules\Admin\Controllers;

use App\Http\Controllers\Controller;

//use Illuminate\Database\Eloquent\Collection;
//use Illuminate\Http\Request;
use Validator;

class TagRules extends Controller
{

    private $_rules = [
        'no_tag' => [
            'сложные' => 'легкие',
            'черно-белые' => 'цветные',
        ],
        'same' => [
            ['собака', 'собачка', 'пёсик',],
            ['кошечка', 'кошка',],
            ['лисичка', 'лисица', 'лиса',],
            ['зайчик', 'заяц',],
            ['птица', 'птичка',],
            ['сердце', 'сердцечка',],
            ['сердца', 'сердцечки',],
            ['мышь', 'мышка',],
            ['туфли', 'туфельки',],
        ],
        'append' => [
            'люди' => [
                'девочка',
                'мальчик',
                'ребенок',
                'девушка',
                'человек',
            ],
            'овощи' => [
                'овощ',
                'огурец',
                'помидор',
            ],
            'ягоды' => [
                'ягода',
                'земляника',
                'черника',
                'клубника',
                'ежевика',
                'виноград',
            ],
            'фрукты' => [
                'лимон',
                'фрукт',
                'яблоко',
                'банан',
                'апельсин',
                'груша',
                'киви',
            ],
            'мороженое' => [
                'эскимо',
                'рожок с мороженным',
            ],
            'еда' => [
                'ягоды',
                'фрукты',
                'мороженое',
                'овощи',
                'пончик',
                'суши',
                'хлеб',
                'торт',
                'сыр',
                'кекс',
                'леденец',
                'гамбургер',
                'пирог',
                'леденцы',
            ],
            'домашние животные' => [
                'кошка',
                'кот',
                'котенок',
                'кошки',
                'кошечка',
                'кошка',
                'собачка',
                'собака',
                'щенок',
            ],
            'собака' => [
                'далматинец',
            ],
            'морские животные' => [
                'морская звезда',
                'рыба',
                'рыбка',
                'черепаха',
                'медуза',
                'краб',
            ],
            'животные' => [
                'хомяк',
                'мышонок',
                'козленок',
                'змея',
                'осёл',
                'верблюд',
                'попугаи',
                'барашек',
                'ленивец',
                'мышь',
                'мышка',
                'орёл',
                'гусь',
                'лисицы',
                'дельфин',
                'слоник',
                'слон',
                'динозавр',
                'зайчик',
                'заяц',
                'крокодил',
                'лисенок',
                'лисичка',
                'лошадь',
                'лис',
                'львенок',
                'медвежонок',
                'медведь',
                'обезьяна',
                'олененок',
                'олень',
                'волк',
                'панда',
                'свинья',
                'птицы',
                'насекомые',
                'морские животные',
                'домашние животные',
            ],
            'насекомые' => [
                'бабочка',
                'бабочки',
            ],
            'деревья' => [
                'пальма',
            ],
            'природа' => [
                'деревья',
                'горы',
                'облака',
            ],
            'птицы' => [
                'пингвин',
                'птица',
                'птичка',
                'попугай',
                'сова',
                'совы',
                'аист',
                'цыпленок',
                'цыплята',
            ],
            'для девочек' => [
                'прическа',
                'пони',
                'бантик',
                'единорог',
                'цветы',
                'сердечки',
                'сердца',
                'сердце',
                'украшение',
                'украшения',
                'помада',
                'платье',
                'туфли',
                'туфельки',
                'фея',
            ],
            'цветы' => [
                'подсолнух',
                'цветок',
                'роза',
                'розы',
            ],
            'посуда' => [
                'чашка',
                'чашечка',
                'бокал',
            ],
            'для мальчиков' => [
                'халк',
                'оружие',
                'покемоны',
                'майнкрафт',
                'minecraft',
            ],
            'милые и няшные' => [
                'красивые',
            ],
            'одежда' => [
                'платье',
            ],
            'обувь' => [
                'туфли',
                'туфельки',
            ],
            'часть тела' => [
                'глаз',
                'глаза',
            ],
            'игрушки' => [
                'плюшевый мишка',
            ],
        ],
        'not_compatible' => [
            ['легкие', 'сложные'],
        ],
    ];

    public function appendByRules(array $tags)
    {
        $result = $tags;
        foreach ($tags as $key => $tag) {
            $tags[$key] = trimData(mb_strtolower($tag));
        }
        foreach ($this->_rules['no_tag'] as $find => $ifNotFind) {
            if (!in_array($find, $tags)) {
                $result[] = $ifNotFind;
            }
        }
        foreach ($this->_rules['same'] as $sameTags) {
            $check = array_intersect($sameTags, $result);
            if ($check) {
                $result = array_merge($result, $sameTags);
            }
        }
        $result = array_unique($result);
        foreach ($tags as $tag) {
            $flag = false;
            $searchTag = $tag;
            do {
                $finded = false;
                foreach ($this->_rules['append'] as $rootTag => $rulesTags) {
                    if (in_array($searchTag, $rulesTags)) {
                        $finded = true;
                        $result[] = $rootTag;
                        $searchTag = $rootTag;
                        break;
                    }
                }
                if (!$finded) {
                    $flag = true;
                }
            } while ($flag === false);
        }
        foreach ($this->_rules['not_compatible'] as $notCompatibleTags) {
            $check = array_intersect($notCompatibleTags, $result);
            if ($check === $notCompatibleTags) {
                throw new \Exception('Несовместимые теги ' . print_r($notCompatibleTags, true));
            }
        }
        return array_unique($result);
    }

}
