<?php

return [
    'fixed_share' => [
        'title' => 'Лучшая благодарность',
        'sub_title' => 'Простой репост сайта в соц. сети очень поможет нам. Спасибо.',
        'collapsed_text' => 'Лучшая благодарность',
        'share_title' => 'Drawitbook.com | Картинки для срисовки - рисуйте, делитесь с друзьями',
    ],
    'btn_up' => [
        'title' => 'К началу страницы',
    ],
    'claim' => [
        'title' => 'Помогите нам сделать проект лучше. Обращение обязательно будет рассмотрено модератором.',
        'subtitle' => 'Причина жалобы:',
        'spr' => [
            1 => 'Оскорбление',
            2 => 'Материал для взрослых',
            3 => 'Пропаганда наркотиков',
            4 => 'Насилие',
            5 => 'Призыв к суициду',
        ],
        'submit' => [
            'text' => 'Отправить',
        ],
        'cancel' => [
            'text' => 'Отменить',
        ],
    ],
];
