<?php

return [
    'main' => [
        'hello' => ' <p>
                    На сайте собрано около <strong>2&nbsp;700 рисунков по клеточкам</strong>.
                </p>
                <p>
                    Воспользуйтесь поиском по сайту или <a href="#tag-list">облаком тегов</a> чтобы найти что-то конкретное.
                </p>
                <p>
                    Голосуйте за понравившиеся рисунки и делитесь с друзьями.
                </p>',
    ],
    'layout' => [
        'footer' => [
            'copyright' => 'Приветствуется копирование и распространение материалов.',
            'slogan' => 'ЛЮБИТЕ РИСОВАТЬ? МЫ ТОЖЕ.',
        ],
        'header' => [
            'search' => [
                'placeholder' => 'Поиск по сайту',
            ],
            'menu' => [
                'home' => 'Главная',
                'categories' => 'Категории',
            ],
        ],
    ],
];
