<?php

return [
    'main' => [
        'hello' => ' <p>
                    На сайте собрано около <strong>2&nbsp;700 рисунков по клеточкам</strong>.
                </p>
                <p>
                    Воспользуйтесь поиском по сайту или <a href="#tag-list">облаком тегов</a> чтобы найти что-то конкретное.
                </p>
                <p>
                    Голосуйте за понравившиеся рисунки и делитесь с друзьями.
                </p>',
    ],
    'pixel_arts' => [
        'index' => [
            'h1' => __('common.pixel_arts'),
            'seo_text' => ' <p>
                Рисовать по клеточкам любит практически каждый ребенок и взрослый. Это очень легко, ведь для этого нужна
                только тетрадь в клеточку. <strong>Рисунки по клеточкам</strong>
                от легких и простых до сложных схем.
                Рисунки подобраны не только для деток 4-5 лет, и 6-7, и 8-9-10 лет, но и для взрослых.
            </p>
            <p>
                Голосуйте за понравившиеся рисунки и делитесь с друзьями.
            </p>',
        ],
        'landing' => [
            'h1' => __('common.pixel_arts') . ' «:TAG»',
            'seo_text_begin' => '<p>Рисовать по клеточкам любит практически каждый ребенок и взрослый. Это очень легко, ведь для этого нужна
            только тетрадь в клеточку. <strong>Рисунки по клеточкам на тему «:Tag»</strong>
            от легких и простых до сложных схем.
            Рисунки подобраны не только для деток 4-5 лет, и 6-7, и 8-9-10 лет, но и для взрослых.
        </p>',
            'seo_text_end' => '<p>
        Если вы хотите сделать креативную открытку своими руками или заполнить дневник оригинальными
        рисунками,
        можно освоить рисование по клеточкам. Картинки по клеточкам - это просто. Хотите научиться классно
        рисовать? Начните с самого простого — с картинок по клеточкам.
        Для это нужна лишь бумага под рукой, да ручка, либо обычный карандаш.
    </p>',
        ],
    ],
    'layout' => [
        'footer' => [
            'copyright' => 'Приветствуется копирование и распространение материалов.',
            'slogan' => 'ЛЮБИТЕ РИСОВАТЬ? МЫ ТОЖЕ.',
        ],
        'header' => [
            'search' => [
                'placeholder' => 'Поиск по сайту',
            ],
            'menu' => [
                'home' => 'Главная',
                'categories' => 'Категории',
            ],
        ],
    ],
];
