<?php

return [
    'search' => [
        'title' => 'Поиск по сайту',
    ],
    'art' => [
        'description' => 'Главное при рисовании по клеточкам придерживаться пропорций будущей картинки. У вас обязательно всё получится.',
    ],
    'home' => [
        'title' => 'рисуйте, развлекайтесь, делитесь с друзьями',
        'description' => 'Главное при рисовании по клеточкам придерживаться пропорций будущей картинки. У вас обязательно всё получится.',
    ],
    'cell_index' => [
        'prefix' => 'Рисунки по клеточкам',
        'description' => 'Рисунки по клеточкам. Схемы чёрно-белых и цветных рисунков от легких и простых до сложных.',
    ],
    'tagged' => [
        'prefix' => 'Рисунки по клеточкам',
        'description_part' => 'Схемы чёрно-белых и цветных рисунков от легких и простых до сложных',
    ],
];
